d-mironov/Bosch-BNO055-STM32/examples/.ccls-cache/@@home@moonraccoon@Documents@Dev@Embedded@Libraries@Bosch-BNO055-STM32@examples/@home@moonraccoon@Documents@Dev@ARM@Bosch-BNO055@Src@bno055@bno055.c
    *buf = (s16)((data[1] << 8) | data[0]) /
           ((imu->_acc_unit == BNO_ACC_UNITSEL_M_S2) ? BNO_ACC_SCALE_M_2
                                                     : BNO_ACC_SCALE_MG);
    return BNO_OK;
};

/**
 * Bosch BNO055 read accelerometer data on Z-axis
 * ----------------------------------------------------------------------
 *
 * Reads the accelerometer data and stores the value in the specified buffer.
 * Unit can be specified with `bno055_set_unit(...)`. (Default: m/s^2)
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[f32*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_acc_z(bno055_t* imu, f32* buf) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    u8 data[2];
    if ((err = bno055_read_regs(*imu, BNO_ACC_DATA_Z_LSB, data, 2)) != BNO_OK) {
        return err;
    }

    *buf = (s16)((data[1] << 8) | data[0]) /
           ((imu->_acc_unit == BNO_ACC_UNITSEL_M_S2) ? BNO_ACC_SCALE_M_2
                                                     : BNO_ACC_SCALE_MG);
    return BNO_OK;
};

/**
 * Bosch BNO055 read acceleration data on all axis
 * ----------------------------------------------------------------------
 *
 * Reads the acceleration data and stores the value in the specified
 * vector buffer. Unit can be specified with `bno055_set_unit(...)`. (Default:
 * m/s^2)
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[bno055_vec3_t*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_acc(bno055_t* imu, bno055_vec3_t* xyz) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    u8 data[6];
    if ((err = bno055_read_regs(*imu, BNO_ACC_DATA_X_LSB, data, 6)) != BNO_OK) {
        return err;
    }
    float scale = (imu->_acc_unit == BNO_ACC_UNITSEL_M_S2) ? BNO_ACC_SCALE_M_2
                                                           : BNO_ACC_SCALE_MG;
    xyz->x = (s16)((data[1] << 8) | data[0]) / scale;
    xyz->y = (s16)((data[3] << 8) | data[2]) / scale;
    xyz->z = (s16)((data[5] << 8) | data[4]) / scale;

    return BNO_OK;
};

/**
 * Bosch BNO055 read linear acceleration data on X-axis
 * ----------------------------------------------------------------------
 *
 * Reads the linear acceleration data and stores the value in the specified
 * buffer. Unit can be specified with `bno055_set_unit(...)`. (Default: m/s^2)
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[f32*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_linear_acc_x(bno055_t* imu, f32* buf) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    u8 data[2];
    if ((err = bno055_read_regs(*imu, BNO_LIA_DATA_X_LSB, data, 2)) != BNO_OK) {
        return err;
    }

    *buf = (s16)((data[1] << 8) | data[0]) /
           ((imu->_acc_unit == BNO_ACC_UNITSEL_M_S2) ? BNO_ACC_SCALE_M_2
                                                     : BNO_ACC_SCALE_MG);
    return BNO_OK;
};

/**
 * Bosch BNO055 read linear acceleration data on Y-axis
 * ----------------------------------------------------------------------
 *
 * Reads the linear acceleration data and stores the value in the specified
 * buffer. Unit can be specified with `bno055_set_unit(...)`. (Default: m/s^2)
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[f32*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_linear_acc_y(bno055_t* imu, f32* buf) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    u8 data[2];
    if ((err = bno055_read_regs(*imu, BNO_LIA_DATA_Y_LSB, data, 2)) != BNO_OK) {
        return err;
    }

    *buf = (s16)((data[1] << 8) | data[0]) /
           ((imu->_acc_unit == BNO_ACC_UNITSEL_M_S2) ? BNO_ACC_SCALE_M_2
                                                     : BNO_ACC_SCALE_MG);
    return BNO_OK;
};

/**
 * Bosch BNO055 read linear acceleration data on Z-axis
 * ----------------------------------------------------------------------
 *
 * Reads the linear acceleration data and stores the value in the specified
 * buffer. Unit can be specified with `bno055_set_unit(...)`. (Default: m/s^2)
 * ----------------------------------------------------------------------
 *
 * Args:
 *     > `imu[bno055_t*]`: BNO055 to read the data from
 *     > `buf[f32*]`: Buffer to store the read value in
 * ----------------------------------------------------------------------
 *
 * Return:
 *     > `error_bno`: `BNO_OK` on success, errorcode else.
 * ----------------------------------------------------------------------
 */
error_bno bno055_linear_acc_z(bno055_t* imu, f32* buf) {
    error_bno err;
#ifdef BNO_AUTO_PAGE_SET
    if ((err = bno055_set_page(imu, BNO_PAGE_0)) != BNO_OK) {
        return err;
    }
#endif  // BNO_AUTO_PAGE_SET
    u8 data[2];
    if ((err = bno055_read_regs(*imu, BNO_LIA_DATA_Z_LSB, data, 2)) != BNO_OK) {
        return err;
    }

